In [1]:
import os
import glob
import pandas as pd
import sqlite3

In [2]:
root_directory = os.path.join('..', 'files', 'input')

tbl0, tbl1, tbl2 = glob.glob(f'{root_directory}/*')

columns_tbl0 = ['K0', 'c01', 'c02', 'c03', 'c04']
columns_tbl1 = ['K0', 'K1', 'c12', 'c13', 'c14', 'c15', 'c16']
columns_tbl2 = ['K1', 'c21', 'c22', 'c23', 'c24', 'c25']


def load_data(directory, columns, name_tbl, connection):

    df = pd.read_csv(
        directory,
        names=columns
    )

    df.to_sql(
        name=name_tbl,
        con=connection,
        if_exists='replace'
    )

    return print(f'se cre贸 {name_tbl} en la base de datos')

In [3]:
con = sqlite3.connect(':memory:')
cur = con.cursor()

In [4]:
load_data(directory=tbl0, columns=columns_tbl0, name_tbl='tbl0', connection=con)
load_data(directory=tbl1, columns=columns_tbl1, name_tbl='tbl1', connection=con)
load_data(directory=tbl2, columns=columns_tbl2, name_tbl='tbl2', connection=con)

se cre贸 tbl0 en la base de datos
se cre贸 tbl1 en la base de datos
se cre贸 tbl2 en la base de datos

In [ ]:
cur.execute(
    """
    SELECT name
    FROM sqlite_master
    WHERE type='table';
    """
).fetchall()

In [5]:
cur.execute(
    """
    SELECT SUM(c12)
    FROM tbl1;
    """
).fetchall()

[(15137.63,)]

In [6]:
cur.execute(
    """
    SELECT COUNT(*)
    FROM tbl1;
    """
).fetchall()

[(30,)]

In [7]:
cur.execute(
    """
    SELECT *
    FROM tbl1
    ORDER BY c14 ASC
    LIMIT 5;
    """
).fetchall()

[(19, 'A', 20, 938.16, 300, '2016-09-12', 0.19, 'BECB'),
 (14, 'C', 15, 370.58, 900, '2016-10-01', 0.11, 'GCDD'),
 (21, 'E', 22, 118.77, 900, '2016-10-29', 0.32, 'GEFE'),
 (11, 'B', 12, 999.72, 800, '2016-11-09', 0.26, 'FCGD'),
 (13, 'E', 14, 832.44, 800, '2016-11-22', 0.39, 'EGFD')]

In [8]:
cur.execute(
    """
    SELECT k0, c16
    FROM tbl1
    WHERE SUBSTR(c16, 1, 1) = k0;
    """
).fetchall()

[('E', 'EGFD'), ('B', 'BDEE'), ('C', 'CCCE')]

In [10]:
cur.execute(
    """
    SELECT *
    FROM tbl0
    WHERE c02 = 100 OR c02 = 600;
    """
).fetchall()

[(1, 'B', 7000, 100, 'OLPKN', 0.2),
 (2, 'C', 1000, 600, 'LMMML', 0.2),
 (3, 'D', 4000, 600, 'PJLJL', 0.4),
 (6, 'G', 5000, 100, 'NLPLO', 0.2)]

In [9]:
cur.execute(
    """
    SELECT *
    FROM tbl1
    WHERE K0 = 'A'
    ORDER BY c14 ASC;
    """
).fetchall()

[(19, 'A', 20, 938.16, 300, '2016-09-12', 0.19, 'BECB'),
 (29, 'A', 30, 135.8, 900, '2017-01-26', 0.23, 'EGAB'),
 (17, 'A', 18, 142.99, 100, '2017-02-12', 0.48, 'GGFD'),
 (25, 'A', 26, 456.47, 400, '2018-01-28', 0.11, 'FGED'),
 (5, 'A', 6, 391.42, 300, '2018-05-15', 0.22, 'BFGB'),
 (9, 'A', 10, 816.51, 600, '2019-04-25', 0.4, 'DAGC')]

In [11]:
cur.execute(
    """
    SELECT *
    FROM tbl1
    WHERE k0 NOT IN ('A', 'B') AND c13 NOT IN (200, 900)
    ORDER BY c14 ASC;
    """
).fetchall()

[(13, 'E', 14, 832.44, 800, '2016-11-22', 0.39, 'EGFD'),
 (7, 'E', 8, 302.86, 700, '2016-12-22', 0.14, 'DFCC'),
 (0, 'E', 1, 273.08, 600, '2016-12-31', 0.21, 'BDGD'),
 (26, 'E', 27, 720.9, 800, '2017-01-16', 0.12, 'FBGD'),
 (3, 'D', 4, 662.69, 800, '2017-03-26', 0.23, 'BGDD'),
 (2, 'E', 3, 305.43, 100, '2017-05-21', 0.21, 'BAED'),
 (12, 'C', 13, 712.61, 400, '2017-10-23', 0.31, 'EDDA'),
 (4, 'C', 5, 822.81, 100, '2017-11-17', 0.35, 'GGFC'),
 (6, 'C', 7, 755.27, 800, '2018-07-04', 0.47, 'GCDB'),
 (24, 'E', 25, 600.9, 700, '2018-11-07', 0.36, 'BBBA'),
 (1, 'D', 2, 756.37, 500, '2019-02-28', 0.37, 'BCCC'),
 (18, 'C', 19, 570.43, 400, '2019-04-12', 0.48, 'FBEE'),
 (23, 'C', 24, 482.32, 300, '2019-05-03', 0.11, 'CCCE')]

In [21]:
cur.execute(
        """
        SELECT  STRFTIME('%Y', c23) AS YEAR,
                AVG(c21)
        FROM tbl2
        GROUP BY YEAR;
        """
).fetchall()

[('2016', 564.4764285714285),
 ('2017', 515.1563636363637),
 ('2018', 557.5593749999999),
 ('2019', 550.9985714285714)]

In [13]:
cur.execute(
    """
    SELECT *
    FROM tbl2
    WHERE c21 = (
        SELECT MIN(c21)
        FROM tbl2
    );
    """
).fetchall()

[(81, 29, 101.11, 100, '2017-11-17', 0.42, 'MV-CB')]

In [14]:
cur.execute(
    """
    SELECT *
    FROM tbl0
    WHERE c02 >= 300;
    """
).fetchall()

[(0, 'A', 5000, 900, 'NMNJL', 0.4),
 (2, 'C', 1000, 600, 'LMMML', 0.2),
 (3, 'D', 4000, 600, 'PJLJL', 0.4),
 (5, 'F', 2000, 300, 'NNPJO', 0.3),
 (8, 'I', 3000, 300, 'PPPPL', 0.3)]

In [20]:
cur.execute(
    """
    SELECT  STRFTIME('%Y', c14) AS YEAR,
            COUNT(*) AS CANT
    FROM tbl1
    GROUP BY Year
    HAVING Year = '2018';
    """
).fetchall()

[('2018', 6)]

In [18]:
cur.execute(
    """
    SELECT  k0,
            MAX(c12),
            MIN(c12)
    FROM tbl1
    GROUP BY k0;
    """
).fetchall()

[('A', 938.16, 135.8),
 ('B', 999.72, 283.4),
 ('C', 822.81, 267.42),
 ('D', 756.37, 317.77),
 ('E', 832.44, 118.77)]

In [22]:
cur.execute(
    """
    SELECT  k0,
            ROUND(AVG(c12), 2)
    FROM tbl1
    WHERE c13 > 400
    GROUP BY k0;
    """
).fetchall()

[('A', 476.16), ('B', 536.52), ('C', 490.83), ('D', 709.53), ('E', 474.83)]

In [17]:
cur.execute(
    """
    SELECT  T1.k0,
            AVG(T2.c21)
    FROM tbl1 T1
    LEFT JOIN tbl2 T2 ON T1.k1 = T2.k1
    WHERE T1.c13 > 400
    GROUP BY T1.k0;
    """
).fetchall()

[('A', 593.495),
 ('B', 575.47),
 ('C', 530.7529999999999),
 ('D', 655.6125),
 ('E', 555.323076923077)]